000_РОЗНИЦА_ЦЕНТР/src/Catalogs/АналитикаХозяйственныхОпераций/АналитикаХозяйственныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитикаХозяйственныхОпераций</name>
  <predefined>
    <items>
      <name>ВозвратОтПокупателя</name>
      <description>Возврат от покупателя</description>
    </items>
    <items>
      <name>ВозвратПоставщику</name>
      <description>Возврат поставщику</description>
    </items>
    <items>
      <name>КомплектацияНоменклатуры</name>
      <description>Комплектация номенклатуры</description>
    </items>
    <items>
      <name>ОприходованиеПоИнвентаризации</name>
      <description>Оприходование по инвентаризации</description>
    </items>
    <items>
      <name>ОприходованиеПоИнвентаризацииСамостоятельной</name>
      <description>Оприходование по инвентаризации самостоятельной</description>
    </items>
    <items>
      <name>ОприходованиеТоваров</name>
      <description>Оприходование товаров</description>
    </items>
    <items>
      <name>ПередачаПодарочныхСертификатовВПодарок</name>
      <description>Передача подарочных сертификатов в подарок</description>
    </items>
    <items>
      <name>ПередачаТоваровДоРеализации</name>
      <description>Передача товаров до реализации</description>
    </items>
    <items>
      <name>ПередачаТоваровПослеРеализации</name>
      <description>Передача товаров после реализации</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ПересортицаТоваров</name>
      <description>Пересортица товаров</description>
    </items>
    <items>
      <name>ПогашениеПодарочныхСертификатов</name>
      <description>Погашение подарочных сертификатов</description>
    </items>
    <items>
      <name>ПоступлениеТоваров</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемТоваровОтДругойОрганизации</name>
      <description>Прием товаров от другой организации</description>
    </items>
    <items>
      <name>ПродажаПодаркаПодарочныйСертификат</name>
      <description>Продажа подарка «Подарочный сертификат»</description>
    </items>
    <items>
      <name>РеализацияТоваров</name>
      <description>Реализация товаров</description>
    </items>
    <items>
      <name>СборкаТоваровПодЗаказПокупателя</name>
      <description>Сборка товаров под заказ покупателя</description>
    </items>
    <items>
      <name>СписаниеНаЗатраты</name>
      <description>Списание на затраты</description>
    </items>
    <items>
      <name>СкидкиПодарки</name>
      <description>Списание на затраты (подарки)</description>
    </items>
    <items>
      <name>СписаниеПоИнвентаризации</name>
      <description>Списание по инвентаризации</description>
    </items>
    <items>
      <name>СписаниеПоИнвентаризацииСамостоятельной</name>
      <description>Списание по инвентаризации самостоятельной</description>
    </items>
  </predefined>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыПоВедомостям</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыРаботнику</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОплатаФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровДоРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровПослеРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваровСПереоценкой</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПриемТоваровОтДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваров</name>
  </enumValues>
  <enumValues>
    <name>СдачаДенежныхСредствВБанк</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасхожденийДенежныхСредств</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/АналитикаХозяйственныхОпераций/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Предопределенный Тогда
		
		ОбъектЭлемент = РеквизитФормыВЗначение("Объект");
		ПравильнаяХозяйственнаяОперация = ОбъектЭлемент.ПолучитьПравильнуюХозяйственнуюОперацию();
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(ПравильнаяХозяйственнаяОперация);
		
		Если ПравильнаяХозяйственнаяОперация = Объект.ХозяйственнаяОперация Тогда
			
			Элементы.ХозяйственнаяОперация.Доступность = Ложь;
			
		Иначе
			
			Объект.ХозяйственнаяОперация = ПравильнаяХозяйственнаяОперация;
			
		КонецЕсли; 
		
	Иначе
		
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтПокупателя);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратПоставщику);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.Оприходование);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеПоИнвентаризации);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.СписаниеНаЗатраты);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.СписаниеПоИнвентаризации);
		
	КонецЕсли;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ДополнительныеОтчетыИОбработки
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
